[
  {
    "deal": {
      "product_description": "The Samsung Galaxy Watch Ultra is a premium 47mm LTE Titanium smartwatch designed for both style and functionality. It features a circular display made with durable materials suitable for outdoor activities, providing GPS tracking, health monitoring, and custom apps for various needs. The robust design integrates a range of smart features including notifications, music control, and heart rate tracking, making it an ideal companion for fitness enthusiasts and tech-savvy users alike.",
      "price": 350.0,
      "url": "https://www.dealnews.com/Samsung-Galaxy-Watch-Ultra-47-mm-LTE-Titanium-Smartwatch-up-to-350-off-w-Trade-in-free-shipping/21663266.html?iref=rss-c142"
    },
    "estimate": 773.8138460593241,
    "discount": 423.8138460593241
  },
  {
    "deal": {
      "product_description": "The Refurbished Unlocked Apple iPhone 14 Pro Max offers an impressive 256GB storage and a huge display, perfect for both media consumption and productivity. Enjoy advanced camera technology for stunning photos. This model is designed to provide a seamless user experience with 5G capabilities for faster downloads and streaming. Refurbished to high standards, it comes in various colors and can support all the latest apps from the App Store, accommodating any Apple enthusiast's needs.",
      "price": 705.0,
      "url": "https://www.dealnews.com/products/Apple/Unlocked-Apple-iPhone-14-Pro-Max-256-GB-Smartphone/462808.html?iref=rss-c142"
    },
    "estimate": 930.8824204895075,
    "discount": 225.88242048950747
  },
  {
    "deal": {
      "product_description": "The Samsung Odyssey Neo G7 is a 43-inch 4K gaming monitor with a Mini-LED backlight. It supports a native resolution of 3840x2160 (4K), with a refresh rate of 144Hz featuring AMD FreeSync technology for smoother gaming visuals. The monitor also functions as a Smart TV, with various apps integrated. Connectivity includes a USB 3.0 hub, one DisplayPort, and two HDMI inputs, facilitating multiple devices and gaming setups.",
      "price": 570.0,
      "url": "https://www.dealnews.com/products/Samsung/Samsung-Odyssey-Neo-G7-43-4-K-144-Hz-Mini-LED-Free-Sync-Smart-Monitor/459768.html?iref=rss-f1912"
    },
    "estimate": 809.6036884329366,
    "discount": 239.60368843293656
  },
  {
    "deal": {
      "product_description": "The Hisense A4 Series 32A45K is a 32-inch LED Smart TV offering a full 1080p (1920x1080) resolution display. It runs on Google TV and supports Google Assistant for voice control. The TV includes one HDMI port for external device connection and is identified by model number 32A45K, delivering solid smart TV functionality at a compact size.",
      "price": 98.0,
      "url": "https://www.dealnews.com/products/Hisense/Hisense-A4-Series-32-A45-K-32-1080-p-LED-Smart-TV/491868.html?iref=rss-c142"
    },
    "estimate": 277.36747582874443,
    "discount": 179.36747582874443
  },
  {
    "deal": {
      "product_description": "The Onn 100012590 24-inch LED Smart TV features a 1280x720 (720p) resolution display that supports streaming and smart TV functionalities. It is compatible with Apple Home, Amazon Alexa, and Google Assistant, easing smart home integration. The TV runs on the Roku platform and offers three HDMI ports for multiple device connectivity.",
      "price": 74.0,
      "url": "https://www.dealnews.com/products/Onn/Onn-100012590-24-720-p-LED-Smart-TV/491867.html?iref=rss-c142"
    },
    "estimate": 205.07276911284862,
    "discount": 131.07276911284862
  },
  {
    "deal": {
      "product_description": "The Unlocked Samsung Galaxy S21+ 5G offers 128GB of storage and includes various connectivity features such as 5G, Bluetooth, GPS, NFC, USB Type-C, and Wi-Fi. It is a high-performance smartphone model SM-G996U known for its fast network capabilities and advanced technology.",
      "price": 170.0,
      "url": "https://www.dealnews.com/products/Samsung/Unlocked-Samsung-Galaxy-S21-5-G-128-GB-Phone/425631.html?iref=rss-c142"
    },
    "estimate": 414.072079239754,
    "discount": 244.07207923975398
  },
  {
    "deal": {
      "product_description": "The bObsweep Dustin Wi-Fi Self-Emptying Robot Vacuum & Mop is a high-demand smart cleaning device featuring a 70-day self-emptying container that reduces maintenance frequency. It supports voice control through Alexa or Google Assistant, allowing convenient hands-free operation. Customizable maps help tailor cleaning routes to your home, and it includes three adjustable suction settings to handle various floor types and debris levels. This model is ideal for users wanting an integrated vacuum and mop with advanced automation features.",
      "price": 200.0,
      "url": "https://www.dealnews.com/products/bObsweep/bObsweep-Dustin-Wi-Fi-Self-Emptying-Robot-Vacuum-Mop/462410.html?iref=rss-f1912"
    },
    "estimate": 344.415224453076,
    "discount": 144.415224453076
  }
]